#Добавление и удаление элементов
'''
1. append(item): добавляет элемент item в конец списка
2. insert(index, item): добавляет элемент item в список по индексу index
3. len(list): Встроенная функция, которая возвращает общее количество элементов в списке
4. pop([index]) — Удаляет и возвращает элемент по указанному индексу (по умолчанию удаляет последний элемент).
'''

# Задача #1: Дан список целых чисел. Напишите программу, 
# которая вычисляет сумму всех чётных элементов в этом списке.
'''
a = 0
list_1 = [13, 25, 36, 44, 53, 65]
for i in range(len(list_1)):
    if list_1[i] % 2 == 0:
        a = a + list_1[i]
print(a)
'''

#Здача №2: Дан список чисел. Найдите максимальный и минимальный элементы в списке,
# а также их индексы. Без использования встроенных функций max() и min().
a = 0
b = 100000
list_1 = [13, 25, 36, 44, 53, 65]
for i in range(len(list_1)):
    if list_1[i] > a:
        a = list_1[i]
    if list_1[i] < b:
        b = list_1[i]
print(f'Максимальное число: {a}')
print(f'Минимальное число: {b}')